<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/c791962b-a427-4b2f-b97b-0ba6d394f40f/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-notify/prod-notify-service"
        name                               = "prod-notify-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:17" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:17" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod-notify" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_replica_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_replica_instances" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = "prod-notify-keystore-docdb-primary-cluster"
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + enable_performance_insights     = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "prod-notify-keystore-docdb-replica-instance-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.large"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 1
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags_all                        = {
          + "Application" = "notify"
          + "Name"        = "walletconnect-prod-notify"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + writer                          = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-notify/prod-notify-service"%0A        name                               = "prod-notify-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:17" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:17" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "prod-notify" -> (known after apply)%0A      ~ revision                 = 17 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_replica_instances[0] will be created%0A  + resource "aws_docdb_cluster_instance" "docdb_replica_instances" {%0A      + apply_immediately               = (known after apply)%0A      + arn                             = (known after apply)%0A      + auto_minor_version_upgrade      = true%0A      + availability_zone               = (known after apply)%0A      + ca_cert_identifier              = (known after apply)%0A      + cluster_identifier              = "prod-notify-keystore-docdb-primary-cluster"%0A      + db_subnet_group_name            = (known after apply)%0A      + dbi_resource_id                 = (known after apply)%0A      + enable_performance_insights     = (known after apply)%0A      + endpoint                        = (known after apply)%0A      + engine                          = "docdb"%0A      + engine_version                  = (known after apply)%0A      + id                              = (known after apply)%0A      + identifier                      = "prod-notify-keystore-docdb-replica-instance-0"%0A      + identifier_prefix               = (known after apply)%0A      + instance_class                  = "db.r5.large"%0A      + kms_key_id                      = (known after apply)%0A      + performance_insights_kms_key_id = (known after apply)%0A      + port                            = (known after apply)%0A      + preferred_backup_window         = (known after apply)%0A      + preferred_maintenance_window    = (known after apply)%0A      + promotion_tier                  = 1%0A      + publicly_accessible             = (known after apply)%0A      + storage_encrypted               = (known after apply)%0A      + tags_all                        = {%0A          + "Application" = "notify"%0A          + "Name"        = "walletconnect-prod-notify"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + writer                          = (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*